app/controllers/bookmarks_controller.rb

  def index
    @bookmarks = Bookmark.all
---
SELECT "bookmarks".* FROM "bookmarks"

  def create
    @bookmark = Bookmark.new(bookmark_params)

    respond_to do |format|
      if @bookmark.save
---
INSERT INTO "bookmarks" ("title", "address", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "title"], ["address", "address"], ["description", "description"], ["created_at", 2017-04-18 00:48:27 UTC], ["updated_at", 2017-04-18 00:48:27 UTC]]

    def set_bookmark
      @bookmark = Bookmark.find(params[:id])
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]